[
  {
    "title": "Software Engineer",
    "source": "Lockheed Martin",
    "sourceUrl": "https://www.lockheedmartinjobs.com/job/boulder/software-engineer/694/8061488",
    "city": "Boulder",
    "state": "Colorado",
    "country": "United States",
    "description": "We are seeking a Software Engineer to join our dynamic and growing team! The selected candidate will design, develop, and test software solutions across our contracted efforts, supporting multiple baselines in defect resolution as well as enhancements, special projects, new business initiatives, and modernization efforts. The successful candidate will be a passionate coder, someone who loves a challenge and always rises to the occasion to ensure success. They embrace modern development practices and insist that others do as well. Only a Secret Clearance is required to start, and there are multiple openings for each position.",
    "status": "active",
    "remote": false,
    "tags": [
      "Java",
      "C++"
    ]
  },
  {
    "title": "Software Engineer",
    "source": "MasterControl",
    "sourceUrl": "https://mastercontrol.applicantpro.com/jobs/908219.html",
    "city": "Cottonwood Heights",
    "state": "Utah",
    "country": "United States",
    "description": "Software Engineer will be responsible for the design, development, implementation, and analysis of the company's technical products and systems. Performs engineering design evaluations and may develop a range of products. Uses professional concepts and company policies to solve a wide range of difficult problems in imaginative and practical ways. Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Exercises judgment within generally defined practices and policies in selecting methods and techniques for obtaining solutions. Normally receives no instruction on routine work, general instructions on new assignments. May lead and direct the work of others. Considered highly skilled and proficient in discipline. Works under minimal supervision with wide latitude for independent judgment.",
    "status": "active",
    "remote": false,
    "tags": [
      "Java",
      ".Net",
      "Oracle",
      "Angular",
      "Ruby",
      "JavaScript"
    ]
  },
  {
    "title": "Software Quality Assurance Engineer",
    "source": "MasterControl",
    "sourceUrl": "https://mastercontrol.applicantpro.com/jobs/908219.html",
    "city": "Cottonwood Heights",
    "state": "Utah",
    "country": "United States",
    "description": "MasterControl is looking for creative, energetic automation test engineers to join our software quality team. Team members will use innovative test tools and methods, working closely with product managers and developers in an agile environment, to proactively ensure delivery of the best software possible.",
    "status": "active",
    "remote": false,
    "tags": [
      "Quality Assurance",
      "QA",
      "SQL",
      "Oracle",
      "Angular",
      "Ruby",
      "JavaScript"
    ]
  }
]